Documents/МатериальнаяПомощь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>МатериальнаяПомощь</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаПодписания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ_МатериальнаяПомощь</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ФИО</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СписокГруппы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выписано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/МатериальнаяПомощь/Ext/ManagerModule.bsl
Процедура ПечатьСпискаМатериальнойПомощи(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьСпискаМатериальнойПомощи)
	Макет = Документы.МатериальнаяПомощь.ПолучитьМакет("ПечатьСпискаМатериальнойПомощи");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	МатериальнаяПомощь.Дата,
	|	МатериальнаяПомощь.ДатаПодписания,
	|	МатериальнаяПомощь.Комментарий,
	|	МатериальнаяПомощь.Номер,
	|	МатериальнаяПомощь.ТЧ_МатериальнаяПомощь.(
	|		НомерСтроки,
	|		ФИО,
	|		ИНН,
	|		Выписано
	|	)
	|ИЗ
	|	Документ.МатериальнаяПомощь КАК МатериальнаяПомощь
	|ГДЕ
	|	МатериальнаяПомощь.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьТЧ_МатериальнаяПомощьШапка = Макет.ПолучитьОбласть("ТЧ_МатериальнаяПомощьШапка");
	ОбластьТЧ_МатериальнаяПомощь = Макет.ПолучитьОбласть("ТЧ_МатериальнаяПомощь");
	Подвал = Макет.ПолучитьОбласть("Подвал");

	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТабДок.Вывести(ОбластьЗаголовок);

		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());

		ТабДок.Вывести(ОбластьТЧ_МатериальнаяПомощьШапка);
		ВыборкаТЧ_МатериальнаяПомощь = Выборка.ТЧ_МатериальнаяПомощь.Выбрать();
		Пока ВыборкаТЧ_МатериальнаяПомощь.Следующий() Цикл
			ОбластьТЧ_МатериальнаяПомощь.Параметры.Заполнить(ВыборкаТЧ_МатериальнаяПомощь);
			ТабДок.Вывести(ОбластьТЧ_МатериальнаяПомощь, ВыборкаТЧ_МатериальнаяПомощь.Уровень());
		КонецЦикла;

		Подвал.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Подвал);

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	//}}
КонецПроцедуры
